_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_25 (Dense)             (None, 64)                5120      
_________________________________________________________________
batch_normalization_21 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_21 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_26 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_22 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_22 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_27 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_23 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_23 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_28 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_24 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_24 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_30 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 3000 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[13.599317258523651, 13.599317258523651]
mean_absolute_error training loss
15.998018213082382
