_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 74)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               7500      
_________________________________________________________________
batch_normalization_1 (Batch (None, 100)               400       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 60)                6060      
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 60)                240       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 60)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 40)                2440      
_________________________________________________________________
batch_normalization_3 (Batch (None, 40)                160       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 40)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 25)                1025      
=================================================================
Total params: 17,825
Trainable params: 17,425
Non-trainable params: 400
_________________________________________________________________


Bessaker Vindpark
recreating baseline
Features: 74
Optimizer: adam
Dropoutrate: 0.15
Trained 5000 epochs
mean_absolute_error test evaluation
3.8118030757019934
