_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 90)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                5824      
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
batch_normalization_3 (Batch (None, 16)                64        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 16)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 136       
_________________________________________________________________
batch_normalization_4 (Batch (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 8)                 0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network, trying to recreate earlier results
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[4.183200388679459, 4.183200388679459]
mean_absolute_error training loss
3.692603100172734
