____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 79)            0                                            
____________________________________________________________________________________________________
dense_19 (Dense)                 (None, 32)            2560        input_2[0][0]                    
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 128)           10240       input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 32)            128         dense_19[0][0]                   
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, 128)           512         dense_24[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)       (None, 32)            0           batch_normalization_15[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)       (None, 128)           0           batch_normalization_19[0][0]     
____________________________________________________________________________________________________
dense_20 (Dense)                 (None, 16)            528         leaky_re_lu_15[0][0]             
____________________________________________________________________________________________________
dense_25 (Dense)                 (None, 64)            8256        leaky_re_lu_19[0][0]             
____________________________________________________________________________________________________
dense_29 (Dense)                 (None, 64)            5120        input_2[0][0]                    
____________________________________________________________________________________________________
dense_33 (Dense)                 (None, 16)            1280        input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 16)            64          dense_20[0][0]                   
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 64)            0           dense_25[0][0]                   
____________________________________________________________________________________________________
batch_normalization_23 (BatchNor (None, 64)            256         dense_29[0][0]                   
____________________________________________________________________________________________________
batch_normalization_26 (BatchNor (None, 16)            64          dense_33[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)       (None, 16)            0           batch_normalization_16[0][0]     
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, 64)            256         dropout_6[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)       (None, 64)            0           batch_normalization_23[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)       (None, 16)            0           batch_normalization_26[0][0]     
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 8)             136         leaky_re_lu_16[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)       (None, 64)            0           batch_normalization_20[0][0]     
____________________________________________________________________________________________________
dense_30 (Dense)                 (None, 16)            1040        leaky_re_lu_23[0][0]             
____________________________________________________________________________________________________
dense_34 (Dense)                 (None, 8)             136         leaky_re_lu_26[0][0]             
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 8)             0           dense_21[0][0]                   
____________________________________________________________________________________________________
dense_26 (Dense)                 (None, 32)            2080        leaky_re_lu_20[0][0]             
____________________________________________________________________________________________________
batch_normalization_24 (BatchNor (None, 16)            64          dense_30[0][0]                   
____________________________________________________________________________________________________
batch_normalization_27 (BatchNor (None, 8)             32          dense_34[0][0]                   
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, 8)             32          dropout_5[0][0]                  
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, 32)            128         dense_26[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)       (None, 16)            0           batch_normalization_24[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)       (None, 8)             0           batch_normalization_27[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)       (None, 8)             0           batch_normalization_17[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)       (None, 32)            0           batch_normalization_21[0][0]     
____________________________________________________________________________________________________
dense_31 (Dense)                 (None, 6)             102         leaky_re_lu_24[0][0]             
____________________________________________________________________________________________________
dense_35 (Dense)                 (None, 8)             72          leaky_re_lu_27[0][0]             
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 2)             18          leaky_re_lu_17[0][0]             
____________________________________________________________________________________________________
dense_27 (Dense)                 (None, 8)             264         leaky_re_lu_21[0][0]             
____________________________________________________________________________________________________
dropout_7 (Dropout)              (None, 6)             0           dense_31[0][0]                   
____________________________________________________________________________________________________
dropout_8 (Dropout)              (None, 8)             0           dense_35[0][0]                   
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, 2)             8           dense_22[0][0]                   
____________________________________________________________________________________________________
batch_normalization_22 (BatchNor (None, 8)             32          dense_27[0][0]                   
____________________________________________________________________________________________________
batch_normalization_25 (BatchNor (None, 6)             24          dropout_7[0][0]                  
____________________________________________________________________________________________________
batch_normalization_28 (BatchNor (None, 8)             32          dropout_8[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)       (None, 2)             0           batch_normalization_18[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)       (None, 8)             0           batch_normalization_22[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)       (None, 6)             0           batch_normalization_25[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)       (None, 8)             0           batch_normalization_28[0][0]     
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 1)             3           leaky_re_lu_18[0][0]             
____________________________________________________________________________________________________
dense_28 (Dense)                 (None, 1)             9           leaky_re_lu_22[0][0]             
____________________________________________________________________________________________________
dense_32 (Dense)                 (None, 1)             7           leaky_re_lu_25[0][0]             
____________________________________________________________________________________________________
dense_36 (Dense)                 (None, 1)             9           leaky_re_lu_28[0][0]             
____________________________________________________________________________________________________
average_2 (Average)              (None, 1)             0           dense_23[0][0]                   
                                                                   dense_28[0][0]                   
                                                                   dense_32[0][0]                   
                                                                   dense_36[0][0]                   
====================================================================================================
Total params: 33,492
Trainable params: 32,676
Non-trainable params: 816
____________________________________________________________________________________________________


Bessaker large
training on network forest, only 8000
Features: 79
Optimizer: adam
Dropoutrate: 0.3
Trained 500 epochs
mean_absolute_error test evaluation
[3.9600929840635386, 3.9600929840635386]
mean_absolute_error training loss
3.0791366958618163
