_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_43 (Dense)             (None, 64)                5120      
_________________________________________________________________
batch_normalization_36 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_36 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_44 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_37 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_37 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_45 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_38 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_38 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_46 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_39 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_39 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_48 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 12000 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[17.924992379927694, 17.924992379927694]
mean_absolute_error training loss
19.26375234884633
