__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 76)           0                                            
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 32)           2464        input_3[0][0]                    
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 128)          9856        input_3[0][0]                    
__________________________________________________________________________________________________
dense_43 (Dense)                (None, 32)           2464        input_3[0][0]                    
__________________________________________________________________________________________________
dense_48 (Dense)                (None, 64)           4928        input_3[0][0]                    
__________________________________________________________________________________________________
dense_57 (Dense)                (None, 69)           5313        input_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 32)           128         dense_25[0][0]                   
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 128)          512         dense_30[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 32)           128         dense_43[0][0]                   
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 64)           256         dense_48[0][0]                   
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, 69)           276         dense_57[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 32)           0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)      (None, 128)          0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 32)           0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (None, 64)           0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_45 (LeakyReLU)      (None, 69)           0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 16)           528         leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 64)           8256        leaky_re_lu_24[0][0]             
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 64)           4928        input_3[0][0]                    
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 16)           1232        input_3[0][0]                    
__________________________________________________________________________________________________
dense_44 (Dense)                (None, 16)           528         leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
dense_49 (Dense)                (None, 64)           4160        leaky_re_lu_38[0][0]             
__________________________________________________________________________________________________
dense_53 (Dense)                (None, 12)           924         input_3[0][0]                    
__________________________________________________________________________________________________
dense_58 (Dense)                (None, 128)          8960        leaky_re_lu_45[0][0]             
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 16)           64          dense_26[0][0]                   
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 64)           256         dense_31[0][0]                   
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, 64)           256         dense_35[0][0]                   
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 16)           64          dense_39[0][0]                   
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 16)           64          dense_44[0][0]                   
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 64)           256         dense_49[0][0]                   
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 12)           48          dense_53[0][0]                   
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, 128)          512         dense_58[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 16)           0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)      (None, 64)           0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)      (None, 64)           0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 16)           0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (None, 16)           0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)      (None, 64)           0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (None, 12)           0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_46 (LeakyReLU)      (None, 128)          0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 8)            136         leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 32)           2080        leaky_re_lu_25[0][0]             
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 16)           1040        leaky_re_lu_28[0][0]             
__________________________________________________________________________________________________
dense_40 (Dense)                (None, 8)            136         leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
dense_45 (Dense)                (None, 8)            136         leaky_re_lu_35[0][0]             
__________________________________________________________________________________________________
dense_50 (Dense)                (None, 32)           2080        leaky_re_lu_39[0][0]             
__________________________________________________________________________________________________
dense_54 (Dense)                (None, 6)            78          leaky_re_lu_42[0][0]             
__________________________________________________________________________________________________
dense_59 (Dense)                (None, 32)           4128        leaky_re_lu_46[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 8)            32          dense_27[0][0]                   
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 32)           128         dense_32[0][0]                   
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, 16)           64          dense_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 8)            32          dense_40[0][0]                   
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 8)            32          dense_45[0][0]                   
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 32)           128         dense_50[0][0]                   
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 6)            24          dense_54[0][0]                   
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, 32)           128         dense_59[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)      (None, 8)            0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)      (None, 32)           0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)      (None, 16)           0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 8)            0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (None, 8)            0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (None, 32)           0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)      (None, 6)            0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_47 (LeakyReLU)      (None, 32)           0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 2)            18          leaky_re_lu_22[0][0]             
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 8)            264         leaky_re_lu_26[0][0]             
__________________________________________________________________________________________________
dense_37 (Dense)                (None, 6)            102         leaky_re_lu_29[0][0]             
__________________________________________________________________________________________________
dense_41 (Dense)                (None, 8)            72          leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
dense_46 (Dense)                (None, 2)            18          leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
dense_51 (Dense)                (None, 16)           528         leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
dense_55 (Dense)                (None, 3)            21          leaky_re_lu_43[0][0]             
__________________________________________________________________________________________________
dense_60 (Dense)                (None, 4)            132         leaky_re_lu_47[0][0]             
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 2)            8           dense_28[0][0]                   
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, 8)            32          dense_33[0][0]                   
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 6)            24          dense_37[0][0]                   
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 8)            32          dense_41[0][0]                   
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 2)            8           dense_46[0][0]                   
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 16)           64          dense_51[0][0]                   
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 3)            12          dense_55[0][0]                   
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, 4)            16          dense_60[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)      (None, 2)            0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)      (None, 8)            0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 6)            0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 8)            0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)      (None, 2)            0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)      (None, 16)           0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_44 (LeakyReLU)      (None, 3)            0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_48 (LeakyReLU)      (None, 4)            0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 1)            3           leaky_re_lu_23[0][0]             
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 1)            9           leaky_re_lu_27[0][0]             
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 1)            7           leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
dense_42 (Dense)                (None, 1)            9           leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
dense_47 (Dense)                (None, 1)            3           leaky_re_lu_37[0][0]             
__________________________________________________________________________________________________
dense_52 (Dense)                (None, 1)            17          leaky_re_lu_41[0][0]             
__________________________________________________________________________________________________
dense_56 (Dense)                (None, 1)            4           leaky_re_lu_44[0][0]             
__________________________________________________________________________________________________
dense_61 (Dense)                (None, 1)            5           leaky_re_lu_48[0][0]             
__________________________________________________________________________________________________
average_2 (Average)             (None, 1)            0           dense_29[0][0]                   
                                                                 dense_34[0][0]                   
                                                                 dense_38[0][0]                   
                                                                 dense_42[0][0]                   
                                                                 dense_47[0][0]                   
                                                                 dense_52[0][0]                   
                                                                 dense_56[0][0]                   
                                                                 dense_61[0][0]                   
==================================================================================================
Total params: 69,151
Trainable params: 67,359
Non-trainable params: 1,792
__________________________________________________________________________________________________


Bessaker Vindpark
training on network forest
Features: 76
Optimizer: adam
Dropoutrate: 0.3
Trained 3000 epochs
mean_absolute_error test evaluation
[3.7581079243527813, 3.7581079243527813]
mean_absolute_error training loss
1.024222828936211
