_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_11 (InputLayer)        (None, 90)                0         
_________________________________________________________________
dense_61 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_51 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_51 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_62 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_52 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_52 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_63 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_53 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_53 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_64 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_54 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_54 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_66 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 20000 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[4.6331868516546626, 4.6331868516546626]
mean_absolute_error training loss
4.577611719394264
