_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_13 (InputLayer)        (None, 90)                0         
_________________________________________________________________
dense_73 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_61 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_61 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_74 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_62 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_62 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_75 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_63 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_63 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_76 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_64 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_64 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_78 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 28000 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[4.8677903826272768, 4.8677903826272768]
mean_absolute_error training loss
4.639004985899469
