____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 79)            0                                            
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 32)            2560        input_1[0][0]                    
____________________________________________________________________________________________________
dense_6 (Dense)                  (None, 128)           10240       input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 32)            128         dense_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 128)           512         dense_6[0][0]                    
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 32)            0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 128)           0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 16)            528         leaky_re_lu_1[0][0]              
____________________________________________________________________________________________________
dense_7 (Dense)                  (None, 64)            8256        leaky_re_lu_5[0][0]              
____________________________________________________________________________________________________
dense_11 (Dense)                 (None, 64)            5120        input_1[0][0]                    
____________________________________________________________________________________________________
dense_15 (Dense)                 (None, 16)            1280        input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 16)            64          dense_2[0][0]                    
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 64)            0           dense_7[0][0]                    
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 64)            256         dense_11[0][0]                   
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 16)            64          dense_15[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 16)            0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 64)            256         dropout_2[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)        (None, 64)            0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)       (None, 16)            0           batch_normalization_12[0][0]     
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 8)             136         leaky_re_lu_2[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 64)            0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
dense_12 (Dense)                 (None, 16)            1040        leaky_re_lu_9[0][0]              
____________________________________________________________________________________________________
dense_16 (Dense)                 (None, 8)             136         leaky_re_lu_12[0][0]             
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 8)             0           dense_3[0][0]                    
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 32)            2080        leaky_re_lu_6[0][0]              
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 16)            64          dense_12[0][0]                   
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 8)             32          dense_16[0][0]                   
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 8)             32          dropout_1[0][0]                  
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 32)            128         dense_8[0][0]                    
____________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)       (None, 16)            0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)       (None, 8)             0           batch_normalization_13[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 8)             0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 32)            0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
dense_13 (Dense)                 (None, 6)             102         leaky_re_lu_10[0][0]             
____________________________________________________________________________________________________
dense_17 (Dense)                 (None, 8)             72          leaky_re_lu_13[0][0]             
____________________________________________________________________________________________________
dense_4 (Dense)                  (None, 2)             18          leaky_re_lu_3[0][0]              
____________________________________________________________________________________________________
dense_9 (Dense)                  (None, 8)             264         leaky_re_lu_7[0][0]              
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 6)             0           dense_13[0][0]                   
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 8)             0           dense_17[0][0]                   
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 2)             8           dense_4[0][0]                    
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 8)             32          dense_9[0][0]                    
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 6)             24          dropout_3[0][0]                  
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 8)             32          dropout_4[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 2)             0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)        (None, 8)             0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)       (None, 6)             0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)       (None, 8)             0           batch_normalization_14[0][0]     
____________________________________________________________________________________________________
dense_5 (Dense)                  (None, 1)             3           leaky_re_lu_4[0][0]              
____________________________________________________________________________________________________
dense_10 (Dense)                 (None, 1)             9           leaky_re_lu_8[0][0]              
____________________________________________________________________________________________________
dense_14 (Dense)                 (None, 1)             7           leaky_re_lu_11[0][0]             
____________________________________________________________________________________________________
dense_18 (Dense)                 (None, 1)             9           leaky_re_lu_14[0][0]             
____________________________________________________________________________________________________
average_1 (Average)              (None, 1)             0           dense_5[0][0]                    
                                                                   dense_10[0][0]                   
                                                                   dense_14[0][0]                   
                                                                   dense_18[0][0]                   
====================================================================================================
Total params: 33,492
Trainable params: 32,676
Non-trainable params: 816
____________________________________________________________________________________________________


Bessaker large
training on network forest full dataset 38000
Features: 79
Optimizer: adam
Dropoutrate: 0.3
Trained 500 epochs
mean_absolute_error test evaluation
[3.9565659018176134, 3.9565659018176134]
mean_absolute_error training loss
3.3836502742767336
