_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 76)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                4928      
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 64)                256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_2 (Batch (None, 32)                128       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 16)                528       
_________________________________________________________________
batch_normalization_3 (Batch (None, 16)                64        
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 16)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 136       
_________________________________________________________________
batch_normalization_4 (Batch (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 8)                 0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 9         
=================================================================
Total params: 8,161
Trainable params: 7,921
Non-trainable params: 240
_________________________________________________________________


Bessaker Vindpark
Regular network, dataset advanced
Features: 76
Optimizer: adam
Dropoutrate: 0
Trained 3000 epochs
mean_absolute_error test evaluation
[3.979216040150252, 3.979216040150252]
mean_absolute_error training loss
2.3697053727744515
