_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 64)                5120      
_________________________________________________________________
batch_normalization_44 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_44 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_45 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_45 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_59 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_46 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_46 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_60 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_47 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_47 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_62 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simpole network with 38700 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[4.2919206910072161, 4.2919206910072161]
mean_absolute_error training loss
3.8106832408324056
