_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_12 (InputLayer)        (None, 90)                0         
_________________________________________________________________
dense_67 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_56 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_56 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_68 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_57 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_57 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_69 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_58 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_58 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_70 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_59 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_59 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_72 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 24000 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[4.8234747097469377, 4.8234747097469377]
mean_absolute_error training loss
4.819584345212605
