_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 124)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 64)                8000      
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 64)                256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_4 (Batch (None, 32)                128       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_2 (Dropout)          (None, 16)                0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 16)                64        
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 16)                0         
_________________________________________________________________
dense_6 (Dense)              (None, 8)                 136       
_________________________________________________________________
batch_normalization_6 (Batch (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 8)                 0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 9         
=================================================================
Total params: 11,233
Trainable params: 10,993
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with new dataset and dropout
Features: 124
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[16.35819482029552, 16.35819482029552]
mean_absolute_error training loss
18.75721269312913
