_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (64, 7, 64)               36864     
_________________________________________________________________
lstm_2 (LSTM)                (64, 7, 32)               12416     
_________________________________________________________________
lstm_3 (LSTM)                (64, 7, 16)               3136      
_________________________________________________________________
lstm_4 (LSTM)                (64, 8)                   800       
_________________________________________________________________
dense_1 (Dense)              (64, 1)                   9         
=================================================================
Total params: 53,225
Trainable params: 53,225
Non-trainable params: 0
_________________________________________________________________


Bessaker large
Training lstm network on large dataset, stateful
Features: 79
Lookback: 1 Lookahed: 6
Optimizer: adam
Dropoutrate: 0.3
Trained 2000 epochs
rmse test evaluation
[8.1312105451499566, 8.1312105451499566, 127.93301868702167, 8.1312105451499566]
rmse training loss

