____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 79)            0                                            
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 32)            2560        input_1[0][0]                    
____________________________________________________________________________________________________
dense_7 (Dense)                  (None, 128)           10240       input_1[0][0]                    
____________________________________________________________________________________________________
dense_20 (Dense)                 (None, 32)            2560        input_1[0][0]                    
____________________________________________________________________________________________________
dense_25 (Dense)                 (None, 64)            5120        input_1[0][0]                    
____________________________________________________________________________________________________
dense_34 (Dense)                 (None, 69)            5520        input_1[0][0]                    
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 32)            128         dense_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 128)           512         dense_7[0][0]                    
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 32)            128         dense_20[0][0]                   
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, 64)            256         dense_25[0][0]                   
____________________________________________________________________________________________________
batch_normalization_26 (BatchNor (None, 69)            276         dense_34[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 32)            0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 128)           0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)       (None, 32)            0           batch_normalization_15[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)       (None, 64)            0           batch_normalization_19[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_26 (LeakyReLU)       (None, 69)            0           batch_normalization_26[0][0]     
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 16)            528         leaky_re_lu_1[0][0]              
____________________________________________________________________________________________________
dense_8 (Dense)                  (None, 64)            8256        leaky_re_lu_5[0][0]              
____________________________________________________________________________________________________
dense_12 (Dense)                 (None, 64)            5120        input_1[0][0]                    
____________________________________________________________________________________________________
dense_16 (Dense)                 (None, 16)            1280        input_1[0][0]                    
____________________________________________________________________________________________________
dense_21 (Dense)                 (None, 16)            528         leaky_re_lu_15[0][0]             
____________________________________________________________________________________________________
dense_26 (Dense)                 (None, 64)            4160        leaky_re_lu_19[0][0]             
____________________________________________________________________________________________________
dense_30 (Dense)                 (None, 12)            960         input_1[0][0]                    
____________________________________________________________________________________________________
dense_35 (Dense)                 (None, 128)           8960        leaky_re_lu_26[0][0]             
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 16)            64          dense_3[0][0]                    
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 64)            256         dense_8[0][0]                    
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 64)            256         dense_12[0][0]                   
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 16)            64          dense_16[0][0]                   
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 16)            64          dense_21[0][0]                   
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, 64)            256         dense_26[0][0]                   
____________________________________________________________________________________________________
batch_normalization_23 (BatchNor (None, 12)            48          dense_30[0][0]                   
____________________________________________________________________________________________________
batch_normalization_27 (BatchNor (None, 128)           512         dense_35[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 16)            0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 64)            0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)        (None, 64)            0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)       (None, 16)            0           batch_normalization_12[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)       (None, 16)            0           batch_normalization_16[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)       (None, 64)            0           batch_normalization_20[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_23 (LeakyReLU)       (None, 12)            0           batch_normalization_23[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_27 (LeakyReLU)       (None, 128)           0           batch_normalization_27[0][0]     
____________________________________________________________________________________________________
dense_4 (Dense)                  (None, 8)             136         leaky_re_lu_2[0][0]              
____________________________________________________________________________________________________
dense_9 (Dense)                  (None, 32)            2080        leaky_re_lu_6[0][0]              
____________________________________________________________________________________________________
dense_13 (Dense)                 (None, 16)            1040        leaky_re_lu_9[0][0]              
____________________________________________________________________________________________________
dense_17 (Dense)                 (None, 8)             136         leaky_re_lu_12[0][0]             
____________________________________________________________________________________________________
dense_22 (Dense)                 (None, 8)             136         leaky_re_lu_16[0][0]             
____________________________________________________________________________________________________
dense_27 (Dense)                 (None, 32)            2080        leaky_re_lu_20[0][0]             
____________________________________________________________________________________________________
dense_31 (Dense)                 (None, 6)             78          leaky_re_lu_23[0][0]             
____________________________________________________________________________________________________
dense_36 (Dense)                 (None, 32)            4128        leaky_re_lu_27[0][0]             
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 8)             32          dense_4[0][0]                    
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 32)            128         dense_9[0][0]                    
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 16)            64          dense_13[0][0]                   
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 8)             32          dense_17[0][0]                   
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, 8)             32          dense_22[0][0]                   
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, 32)            128         dense_27[0][0]                   
____________________________________________________________________________________________________
batch_normalization_24 (BatchNor (None, 6)             24          dense_31[0][0]                   
____________________________________________________________________________________________________
batch_normalization_28 (BatchNor (None, 32)            128         dense_36[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 8)             0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 32)            0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)       (None, 16)            0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)       (None, 8)             0           batch_normalization_13[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)       (None, 8)             0           batch_normalization_17[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)       (None, 32)            0           batch_normalization_21[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_24 (LeakyReLU)       (None, 6)             0           batch_normalization_24[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_28 (LeakyReLU)       (None, 32)            0           batch_normalization_28[0][0]     
____________________________________________________________________________________________________
dense_5 (Dense)                  (None, 2)             18          leaky_re_lu_3[0][0]              
____________________________________________________________________________________________________
dense_10 (Dense)                 (None, 8)             264         leaky_re_lu_7[0][0]              
____________________________________________________________________________________________________
dense_14 (Dense)                 (None, 6)             102         leaky_re_lu_10[0][0]             
____________________________________________________________________________________________________
dense_18 (Dense)                 (None, 8)             72          leaky_re_lu_13[0][0]             
____________________________________________________________________________________________________
dense_23 (Dense)                 (None, 2)             18          leaky_re_lu_17[0][0]             
____________________________________________________________________________________________________
dense_28 (Dense)                 (None, 16)            528         leaky_re_lu_21[0][0]             
____________________________________________________________________________________________________
dense_32 (Dense)                 (None, 3)             21          leaky_re_lu_24[0][0]             
____________________________________________________________________________________________________
dense_37 (Dense)                 (None, 4)             132         leaky_re_lu_28[0][0]             
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 2)             8           dense_5[0][0]                    
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 8)             32          dense_10[0][0]                   
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 6)             24          dense_14[0][0]                   
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 8)             32          dense_18[0][0]                   
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, 2)             8           dense_23[0][0]                   
____________________________________________________________________________________________________
batch_normalization_22 (BatchNor (None, 16)            64          dense_28[0][0]                   
____________________________________________________________________________________________________
batch_normalization_25 (BatchNor (None, 3)             12          dense_32[0][0]                   
____________________________________________________________________________________________________
batch_normalization_29 (BatchNor (None, 4)             16          dense_37[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 2)             0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)        (None, 8)             0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)       (None, 6)             0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)       (None, 8)             0           batch_normalization_14[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)       (None, 2)             0           batch_normalization_18[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_22 (LeakyReLU)       (None, 16)            0           batch_normalization_22[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_25 (LeakyReLU)       (None, 3)             0           batch_normalization_25[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_29 (LeakyReLU)       (None, 4)             0           batch_normalization_29[0][0]     
____________________________________________________________________________________________________
dense_6 (Dense)                  (None, 1)             3           leaky_re_lu_4[0][0]              
____________________________________________________________________________________________________
dense_11 (Dense)                 (None, 1)             9           leaky_re_lu_8[0][0]              
____________________________________________________________________________________________________
dense_15 (Dense)                 (None, 1)             7           leaky_re_lu_11[0][0]             
____________________________________________________________________________________________________
dense_19 (Dense)                 (None, 1)             9           leaky_re_lu_14[0][0]             
____________________________________________________________________________________________________
dense_24 (Dense)                 (None, 1)             3           leaky_re_lu_18[0][0]             
____________________________________________________________________________________________________
dense_29 (Dense)                 (None, 1)             17          leaky_re_lu_22[0][0]             
____________________________________________________________________________________________________
dense_33 (Dense)                 (None, 1)             4           leaky_re_lu_25[0][0]             
____________________________________________________________________________________________________
dense_38 (Dense)                 (None, 1)             5           leaky_re_lu_29[0][0]             
____________________________________________________________________________________________________
average_1 (Average)              (None, 1)             0           dense_6[0][0]                    
                                                                   dense_11[0][0]                   
                                                                   dense_15[0][0]                   
                                                                   dense_19[0][0]                   
                                                                   dense_24[0][0]                   
                                                                   dense_29[0][0]                   
                                                                   dense_33[0][0]                   
                                                                   dense_38[0][0]                   
====================================================================================================
Total params: 70,402
Trainable params: 68,610
Non-trainable params: 1,792
____________________________________________________________________________________________________


Bessaker large
training huge network forest full dataset 38700
Features: 79
Optimizer: adam
Dropoutrate: 0.3
Trained 2000 epochs
mean_absolute_error test evaluation
[4.3165137625672996, 4.3165137625672996]
mean_absolute_error training loss
3.381854687754642
