__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 76)           0                                            
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           2464        input_2[0][0]                    
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 128)          9856        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32)           128         dense_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 128)          512         dense_12[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32)           0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 128)          0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 16)           528         leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 64)           8256        leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 64)           4928        input_2[0][0]                    
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 16)           1232        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 16)           64          dense_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 64)           256         dense_13[0][0]                   
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 64)           256         dense_17[0][0]                   
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 16)           64          dense_21[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 16)           0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 64)           0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 64)           0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 16)           0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 8)            136         leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 32)           2080        leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 16)           1040        leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 8)            136         leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 8)            32          dense_9[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 32)           128         dense_14[0][0]                   
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 16)           64          dense_18[0][0]                   
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 8)            32          dense_22[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 8)            0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 32)           0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 16)           0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 8)            0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 2)            18          leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 8)            264         leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 6)            102         leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 8)            72          leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 2)            8           dense_10[0][0]                   
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 8)            32          dense_15[0][0]                   
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 6)            24          dense_19[0][0]                   
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 8)            32          dense_23[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 2)            0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 8)            0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 6)            0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 8)            0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 1)            3           leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 1)            9           leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 1)            7           leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 1)            9           leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
average_1 (Average)             (None, 1)            0           dense_11[0][0]                   
                                                                 dense_16[0][0]                   
                                                                 dense_20[0][0]                   
                                                                 dense_24[0][0]                   
==================================================================================================
Total params: 32,772
Trainable params: 31,956
Non-trainable params: 816
__________________________________________________________________________________________________


Bessaker Vindpark
training on network forest
Features: 76
Optimizer: adam
Dropoutrate: 0.3
Trained 3000 epochs
mean_absolute_error test evaluation
[3.774182611886138, 3.774182611886138]
mean_absolute_error training loss
1.2415613067366256
