__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
history_input (InputLayer)      (None, 13, 1)        0                                            
__________________________________________________________________________________________________
forecast_input (InputLayer)     (None, 9, 2)         0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 13, 8)        24          history_input[0][0]              
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 9, 8)         40          forecast_input[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 13, 8)        0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 9, 8)         0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
input_1 (InputLayer)            (None, 11)           0                                            
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 3, 8)         0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 2, 8)         0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           768         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 3, 16)        272         max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 2, 16)        272         max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 64)           0           dense_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 3, 16)        0           conv1d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 2, 16)        0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64)           0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 1, 16)        0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 1, 16)        0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        dropout_3[0][0]                  
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 16)           0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 16)           0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32)           0           dense_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 16)           0           flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 16)           0           flatten_2[0][0]                  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 32)           0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64)           0           dropout_1[0][0]                  
                                                                 dropout_2[0][0]                  
                                                                 dropout_4[0][0]                  
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 16)           1040        concatenate_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 16)           0           dense_3[0][0]                    
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 16)           0           leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 8)            136         dropout_5[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 8)            0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 1)            9           leaky_re_lu_8[0][0]              
==================================================================================================
Total params: 4,641
Trainable params: 4,641
Non-trainable params: 0
__________________________________________________________________________________________________


Bessaker large
Conv network
Features: 11
Optimizer: adam
Dropoutrate: 0
Trained 1000 epochs
mean_absolute_error test evaluation
[5.45118115679325, 5.45118115679325]
mean_absolute_error training loss
4.965482227268514
