_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_14 (InputLayer)        (None, 90)                0         
_________________________________________________________________
dense_79 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_66 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_66 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_80 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_67 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_67 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_81 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_68 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_68 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_82 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_69 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_69 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_84 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 38684 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[4.6785737867912465, 4.6785737867912465]
mean_absolute_error training loss
4.892971804240835
