____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_2 (InputLayer)             (None, 79)            0                                            
____________________________________________________________________________________________________
dense_39 (Dense)                 (None, 32)            2560        input_2[0][0]                    
____________________________________________________________________________________________________
dense_44 (Dense)                 (None, 128)           10240       input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_30 (BatchNor (None, 32)            128         dense_39[0][0]                   
____________________________________________________________________________________________________
batch_normalization_34 (BatchNor (None, 128)           512         dense_44[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)       (None, 32)            0           batch_normalization_30[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)       (None, 128)           0           batch_normalization_34[0][0]     
____________________________________________________________________________________________________
dense_40 (Dense)                 (None, 16)            528         leaky_re_lu_30[0][0]             
____________________________________________________________________________________________________
dense_45 (Dense)                 (None, 64)            8256        leaky_re_lu_34[0][0]             
____________________________________________________________________________________________________
dense_49 (Dense)                 (None, 64)            5120        input_2[0][0]                    
____________________________________________________________________________________________________
dense_53 (Dense)                 (None, 16)            1280        input_2[0][0]                    
____________________________________________________________________________________________________
batch_normalization_31 (BatchNor (None, 16)            64          dense_40[0][0]                   
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 64)            0           dense_45[0][0]                   
____________________________________________________________________________________________________
batch_normalization_38 (BatchNor (None, 64)            256         dense_49[0][0]                   
____________________________________________________________________________________________________
batch_normalization_41 (BatchNor (None, 16)            64          dense_53[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)       (None, 16)            0           batch_normalization_31[0][0]     
____________________________________________________________________________________________________
batch_normalization_35 (BatchNor (None, 64)            256         dropout_2[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)       (None, 64)            0           batch_normalization_38[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)       (None, 16)            0           batch_normalization_41[0][0]     
____________________________________________________________________________________________________
dense_41 (Dense)                 (None, 8)             136         leaky_re_lu_31[0][0]             
____________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)       (None, 64)            0           batch_normalization_35[0][0]     
____________________________________________________________________________________________________
dense_50 (Dense)                 (None, 16)            1040        leaky_re_lu_38[0][0]             
____________________________________________________________________________________________________
dense_54 (Dense)                 (None, 8)             136         leaky_re_lu_41[0][0]             
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 8)             0           dense_41[0][0]                   
____________________________________________________________________________________________________
dense_46 (Dense)                 (None, 32)            2080        leaky_re_lu_35[0][0]             
____________________________________________________________________________________________________
batch_normalization_39 (BatchNor (None, 16)            64          dense_50[0][0]                   
____________________________________________________________________________________________________
batch_normalization_42 (BatchNor (None, 8)             32          dense_54[0][0]                   
____________________________________________________________________________________________________
batch_normalization_32 (BatchNor (None, 8)             32          dropout_1[0][0]                  
____________________________________________________________________________________________________
batch_normalization_36 (BatchNor (None, 32)            128         dense_46[0][0]                   
____________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)       (None, 16)            0           batch_normalization_39[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)       (None, 8)             0           batch_normalization_42[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)       (None, 8)             0           batch_normalization_32[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)       (None, 32)            0           batch_normalization_36[0][0]     
____________________________________________________________________________________________________
dense_51 (Dense)                 (None, 6)             102         leaky_re_lu_39[0][0]             
____________________________________________________________________________________________________
dense_55 (Dense)                 (None, 8)             72          leaky_re_lu_42[0][0]             
____________________________________________________________________________________________________
dense_42 (Dense)                 (None, 2)             18          leaky_re_lu_32[0][0]             
____________________________________________________________________________________________________
dense_47 (Dense)                 (None, 8)             264         leaky_re_lu_36[0][0]             
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 6)             0           dense_51[0][0]                   
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 8)             0           dense_55[0][0]                   
____________________________________________________________________________________________________
batch_normalization_33 (BatchNor (None, 2)             8           dense_42[0][0]                   
____________________________________________________________________________________________________
batch_normalization_37 (BatchNor (None, 8)             32          dense_47[0][0]                   
____________________________________________________________________________________________________
batch_normalization_40 (BatchNor (None, 6)             24          dropout_3[0][0]                  
____________________________________________________________________________________________________
batch_normalization_43 (BatchNor (None, 8)             32          dropout_4[0][0]                  
____________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)       (None, 2)             0           batch_normalization_33[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)       (None, 8)             0           batch_normalization_37[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)       (None, 6)             0           batch_normalization_40[0][0]     
____________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)       (None, 8)             0           batch_normalization_43[0][0]     
____________________________________________________________________________________________________
dense_43 (Dense)                 (None, 1)             3           leaky_re_lu_33[0][0]             
____________________________________________________________________________________________________
dense_48 (Dense)                 (None, 1)             9           leaky_re_lu_37[0][0]             
____________________________________________________________________________________________________
dense_52 (Dense)                 (None, 1)             7           leaky_re_lu_40[0][0]             
____________________________________________________________________________________________________
dense_56 (Dense)                 (None, 1)             9           leaky_re_lu_43[0][0]             
____________________________________________________________________________________________________
average_2 (Average)              (None, 1)             0           dense_43[0][0]                   
                                                                   dense_48[0][0]                   
                                                                   dense_52[0][0]                   
                                                                   dense_56[0][0]                   
====================================================================================================
Total params: 33,492
Trainable params: 32,676
Non-trainable params: 816
____________________________________________________________________________________________________


Bessaker large
training best network forest, only 38700
Features: 79
Optimizer: adam
Dropoutrate: 0.3
Trained 2000 epochs
mean_absolute_error test evaluation
[4.2898111325721633, 4.2898111325721633]
mean_absolute_error training loss
3.672461376081033
