_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_13 (Dense)             (None, 64)                5120      
_________________________________________________________________
batch_normalization_11 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_14 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_12 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_13 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_16 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_14 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 500 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[22.783468158039824, 22.783468158039824]
mean_absolute_error training loss
21.916005363601084
