_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 74)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               9600      
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                8256      
_________________________________________________________________
batch_normalization_2 (Batch (None, 64)                256       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_3 (Batch (None, 32)                128       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 32)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 25)                825       
_________________________________________________________________
batch_normalization_4 (Batch (None, 25)                100       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 25)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 25)                650       
=================================================================
Total params: 22,407
Trainable params: 21,909
Non-trainable params: 498
_________________________________________________________________


Bessaker Vindpark
recreating baseline
Features: 74
Optimizer: adam
Dropoutrate: 0.2
Trained 5000 epochs
mean_absolute_error test evaluation
0.1843174200168118
