_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                5120      
_________________________________________________________________
batch_normalization_16 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_17 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_18 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_19 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 1000 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[14.305862467946405, 14.305862467946405]
mean_absolute_error training loss
13.909062283196901
