_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 79)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 64)                5120      
_________________________________________________________________
batch_normalization_6 (Batch (None, 64)                256       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 64)                0         
_________________________________________________________________
dense_8 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_7 (Batch (None, 32)                128       
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 32)                0         
_________________________________________________________________
dense_9 (Dense)              (None, 16)                528       
_________________________________________________________________
batch_normalization_8 (Batch (None, 16)                64        
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 16)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_9 (Batch (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 8)                 0         
_________________________________________________________________
dense_12 (Dense)             (None, 1)                 9         
=================================================================
Total params: 8,353
Trainable params: 8,113
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training with 8000 samples
Features: 79
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[4.264506705449751, 4.264506705449751]
mean_absolute_error training loss
3.0237473528096124
