_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         (None, 90)                0         
_________________________________________________________________
dense_49 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_41 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_41 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_50 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_42 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_42 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_51 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_43 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_43 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_52 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_44 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_44 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_54 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 628 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[3.5575674677652027, 3.5575674677652027]
mean_absolute_error training loss
1.5971917165310634
