_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        (None, 90)                0         
_________________________________________________________________
dense_55 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_46 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_46 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_56 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_47 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_47 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_48 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_48 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_49 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_49 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_60 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 16000 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[4.8804912974352241, 4.8804912974352241]
mean_absolute_error training loss
4.688944529071292
