_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         (None, 90)                0         
_________________________________________________________________
dense_37 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_31 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_31 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_38 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_32 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_32 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_39 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_33 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_33 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_40 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_34 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_34 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_42 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 8000 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 1 epochs
mean_absolute_error test evaluation
[5.0854522469936434, 5.0854522469936434]
mean_absolute_error training loss
4.932745040966799
