_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_6 (InputLayer)         (None, 90)                0         
_________________________________________________________________
dense_31 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_26 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_26 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_32 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_27 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_27 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_33 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_28 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_28 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_34 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_29 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_29 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_36 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 628 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[3.8109715804851874, 3.8109715804851874]
mean_absolute_error training loss
1.4918069139844672
