_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 90)                0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                5824      
_________________________________________________________________
batch_normalization_16 (Batc (None, 64)                256       
_________________________________________________________________
leaky_re_lu_16 (LeakyReLU)   (None, 64)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_17 (Batc (None, 32)                128       
_________________________________________________________________
leaky_re_lu_17 (LeakyReLU)   (None, 32)                0         
_________________________________________________________________
dense_21 (Dense)             (None, 16)                528       
_________________________________________________________________
batch_normalization_18 (Batc (None, 16)                64        
_________________________________________________________________
leaky_re_lu_18 (LeakyReLU)   (None, 16)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 8)                 136       
_________________________________________________________________
batch_normalization_19 (Batc (None, 8)                 32        
_________________________________________________________________
leaky_re_lu_19 (LeakyReLU)   (None, 8)                 0         
_________________________________________________________________
dense_24 (Dense)             (None, 1)                 9         
=================================================================
Total params: 9,057
Trainable params: 8,817
Non-trainable params: 240
_________________________________________________________________


Bessaker large
Training simple network with 628 samples
Features: 90
Optimizer: adam
Dropoutrate: 0
Trained 2000 epochs
mean_absolute_error test evaluation
[3.6932165130736334, 3.6932165130736334]
mean_absolute_error training loss
1.741553461449778
