__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 79)           0                                            
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 32)           2560        input_2[0][0]                    
__________________________________________________________________________________________________
dense_43 (Dense)                (None, 128)          10240       input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, 32)           128         dense_38[0][0]                   
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, 128)          512         dense_43[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_30 (LeakyReLU)      (None, 32)           0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_34 (LeakyReLU)      (None, 128)          0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 16)           528         leaky_re_lu_30[0][0]             
__________________________________________________________________________________________________
dense_44 (Dense)                (None, 64)           8256        leaky_re_lu_34[0][0]             
__________________________________________________________________________________________________
dense_48 (Dense)                (None, 64)           5120        input_2[0][0]                    
__________________________________________________________________________________________________
dense_52 (Dense)                (None, 16)           1280        input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, 16)           64          dense_39[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64)           0           dense_44[0][0]                   
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, 64)           256         dense_48[0][0]                   
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 16)           64          dense_52[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_31 (LeakyReLU)      (None, 16)           0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, 64)           256         dropout_2[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_38 (LeakyReLU)      (None, 64)           0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_41 (LeakyReLU)      (None, 16)           0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
dense_40 (Dense)                (None, 8)            136         leaky_re_lu_31[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_35 (LeakyReLU)      (None, 64)           0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
dense_49 (Dense)                (None, 16)           1040        leaky_re_lu_38[0][0]             
__________________________________________________________________________________________________
dense_53 (Dense)                (None, 8)            136         leaky_re_lu_41[0][0]             
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 8)            0           dense_40[0][0]                   
__________________________________________________________________________________________________
dense_45 (Dense)                (None, 32)           2080        leaky_re_lu_35[0][0]             
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, 16)           64          dense_49[0][0]                   
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 8)            32          dense_53[0][0]                   
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, 8)            32          dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, 32)           128         dense_45[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_39 (LeakyReLU)      (None, 16)           0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_42 (LeakyReLU)      (None, 8)            0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_32 (LeakyReLU)      (None, 8)            0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_36 (LeakyReLU)      (None, 32)           0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
dense_50 (Dense)                (None, 6)            102         leaky_re_lu_39[0][0]             
__________________________________________________________________________________________________
dense_54 (Dense)                (None, 8)            72          leaky_re_lu_42[0][0]             
__________________________________________________________________________________________________
dense_41 (Dense)                (None, 2)            18          leaky_re_lu_32[0][0]             
__________________________________________________________________________________________________
dense_46 (Dense)                (None, 8)            264         leaky_re_lu_36[0][0]             
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 6)            0           dense_50[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 8)            0           dense_54[0][0]                   
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, 2)            8           dense_41[0][0]                   
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, 8)            32          dense_46[0][0]                   
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, 6)            24          dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 8)            32          dropout_4[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_33 (LeakyReLU)      (None, 2)            0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_37 (LeakyReLU)      (None, 8)            0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_40 (LeakyReLU)      (None, 6)            0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
leaky_re_lu_43 (LeakyReLU)      (None, 8)            0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
dense_42 (Dense)                (None, 1)            3           leaky_re_lu_33[0][0]             
__________________________________________________________________________________________________
dense_47 (Dense)                (None, 1)            9           leaky_re_lu_37[0][0]             
__________________________________________________________________________________________________
dense_51 (Dense)                (None, 1)            7           leaky_re_lu_40[0][0]             
__________________________________________________________________________________________________
dense_55 (Dense)                (None, 1)            9           leaky_re_lu_43[0][0]             
__________________________________________________________________________________________________
average_2 (Average)             (None, 1)            0           dense_42[0][0]                   
                                                                 dense_47[0][0]                   
                                                                 dense_51[0][0]                   
                                                                 dense_55[0][0]                   
==================================================================================================
Total params: 33,492
Trainable params: 32,676
Non-trainable params: 816
__________________________________________________________________________________________________


Bessaker large
training best network forest, only 38700
Features: 79
Optimizer: adam
Dropoutrate: 0.3
Trained 500 epochs
mean_absolute_error test evaluation
[4.288086778485649, 4.288086778485649]
mean_absolute_error training loss
3.9683146488188994
